<img src='graphics/three_pandas.jpg'>

<img src='graphics/spacer.png'>

<center><font style="font-size:40px;">Pandas, Part 3 </font></center>

Over the last two sessions, we have introduced and worked with Pandas. In our first session with Pandas we learned: 
1. Importing the Pandas library
1. Creating DataFrames
    1. Creating an Empty DataFrame
    1. Creating a DataFrame from a Python list
    1. Importing a CSV as a Pandas DataFrame (one of the most common ways to import data into Python)
1. .head( )
1. .tail( )
1. .sample( )
1. .shape
1. .keys( ) & .columns
1. .info( )
1. .describe( )
1. .values_count( )
1. Accessing a feature (column) in a DataFrame
1. Accessing an observation (row) in a DataFrame
1. Navigating a DataFrame using .loc( ) and .iloc( ) at an elementary level

In our second session with Pandas we learned:
1. Cleaning cloumn names
1. Cleaning NaN values
1. Using a mask


# Load our libraries and data

In [4]:
import pandas as pd

In [6]:
df = pd.DataFrame({'country': ['United States', 'The Netherlands', 'Spain', 'Mexico', 'Australia'],
                    'capital': ['Washington D.C.', 'Amsterdam', 'Madrid', 'Mexico City', 'Canberra'],
                    'continent': ['North America', 'Europe', 'Europe', 'North America', 'Australia'],
                    'language': ['English', 'Dutch', 'Spanish', 'Spanish', 'English']})

df

           country          capital      continent language
0    United States  Washington D.C.  North America  English
1  The Netherlands        Amsterdam         Europe    Dutch
2            Spain           Madrid         Europe  Spanish
3           Mexico      Mexico City  North America  Spanish
4        Australia         Canberra      Australia  English

# Select multiple rows and columns using .loc

In [7]:
df.loc[:, 'country':'continent']

           country          capital      continent
0    United States  Washington D.C.  North America
1  The Netherlands        Amsterdam         Europe
2            Spain           Madrid         Europe
3           Mexico      Mexico City  North America
4        Australia         Canberra      Australia

In [8]:
df.loc[0:2, 'country':'continent']

           country          capital      continent
0    United States  Washington D.C.  North America
1  The Netherlands        Amsterdam         Europe
2            Spain           Madrid         Europe

In [9]:
df.loc[[0, 4], ['country', 'language']]

         country language
0  United States  English
4      Australia  English

# Filter DataFrames by category

In many cases, we may want to consider only the data points that are included in one particular category, or sometimes in a selection of categories. For a single category, we are able to do this by using the `==` operator. However, for multiple categories, we have to make use of the `isin` function:

In [10]:
df[df.continent == 'Europe']

           country    capital continent language
1  The Netherlands  Amsterdam    Europe    Dutch
2            Spain     Madrid    Europe  Spanish

In [12]:
df[df['continent'] == 'Europe']

           country    capital continent language
1  The Netherlands  Amsterdam    Europe    Dutch
2            Spain     Madrid    Europe  Spanish

In [13]:
df[df.language.isin(['Dutch', 'English'])]

           country          capital      continent language
0    United States  Washington D.C.  North America  English
1  The Netherlands        Amsterdam         Europe    Dutch
4        Australia         Canberra      Australia  English

# Filter DataFrames by excluding categories
As opposed to filtering by category, we may want to filter our DataFrame by excluding certain categories. We do this by making use of the `~` (tilde) sign, which is the complement operator. Example usage:

In [14]:
df[~df.continent.isin(['Europe'])]

         country          capital      continent language
0  United States  Washington D.C.  North America  English
3         Mexico      Mexico City  North America  Spanish
4      Australia         Canberra      Australia  English

In [15]:
df[~df['continent'].isin(['Europe'])]

         country          capital      continent language
0  United States  Washington D.C.  North America  English
3         Mexico      Mexico City  North America  Spanish
4      Australia         Canberra      Australia  English

In [16]:
df[~df.language.isin(['Dutch', 'English'])]

  country      capital      continent language
2   Spain       Madrid         Europe  Spanish
3  Mexico  Mexico City  North America  Spanish

In [17]:
df[~df['language'].isin(['Dutch', 'English'])]

  country      capital      continent language
2   Spain       Madrid         Europe  Spanish
3  Mexico  Mexico City  North America  Spanish

# Reverse row order
To reverse the row order, we make use of the `.loc( )` operator. This works in the following way:

In [18]:
df.loc[::-1]

           country          capital      continent language
4        Australia         Canberra      Australia  English
3           Mexico      Mexico City  North America  Spanish
2            Spain           Madrid         Europe  Spanish
1  The Netherlands        Amsterdam         Europe    Dutch
0    United States  Washington D.C.  North America  English

# Reverse column order
Reversing the column order goes in a similar way as for the rows:

In [19]:
df.loc[:, ::-1]

  language      continent          capital          country
0  English  North America  Washington D.C.    United States
1    Dutch         Europe        Amsterdam  The Netherlands
2  Spanish         Europe           Madrid            Spain
3  Spanish  North America      Mexico City           Mexico
4  English      Australia         Canberra        Australia

# `.loc( )`  in more depth

## Row selection

In [22]:
# row zero all columns
df.loc[0, :]

country        United States
capital      Washington D.C.
continent      North America
language             English
Name: 0, dtype: object

In [26]:
# rows 0, 1, & 3, all columns

df.loc[[0, 1, 3], :]

           country          capital      continent language
0    United States  Washington D.C.  North America  English
1  The Netherlands        Amsterdam         Europe    Dutch
3           Mexico      Mexico City  North America  Spanish

In [25]:
# rows 0 through 2, all columns

df.loc[0:2, :]

           country          capital      continent language
0    United States  Washington D.C.  North America  English
1  The Netherlands        Amsterdam         Europe    Dutch
2            Spain           Madrid         Europe  Spanish

## Column Selection

In [27]:
# All rows, only the 'capital' column

df.loc[:, 'capital']

0    Washington D.C.
1          Amsterdam
2             Madrid
3        Mexico City
4           Canberra
Name: capital, dtype: object

In [28]:
# All rows, only the 'country' and 'capital' columns

df.loc[:, ['country', 'capital']]

           country          capital
0    United States  Washington D.C.
1  The Netherlands        Amsterdam
2            Spain           Madrid
3           Mexico      Mexico City
4        Australia         Canberra

In [30]:
# All rows, and only the 'capital' through 'language' columns

df.loc[:, 'capital':'language']

           capital      continent language
0  Washington D.C.  North America  English
1        Amsterdam         Europe    Dutch
2           Madrid         Europe  Spanish
3      Mexico City  North America  Spanish
4         Canberra      Australia  English

# Combine Methods

In [31]:
# Only rows 1 and 3, and all columns 'capital' through 'language'

df.loc[[1,3], 'capital':'language']

       capital      continent language
1    Amsterdam         Europe    Dutch
3  Mexico City  North America  Spanish

# Boolean Selection

In [40]:
# All rows in which 'Spanish' is in the 'language' column - bracket method

df[df['language'] == 'Spanish']

  country      capital      continent language
2   Spain       Madrid         Europe  Spanish
3  Mexico  Mexico City  North America  Spanish

In [44]:
# All rows in which 'Spanish' is in the 'language' column - dot method

df[df.language == 'Spanish']

  country      capital      continent language
2   Spain       Madrid         Europe  Spanish
3  Mexico  Mexico City  North America  Spanish

# Exercises

In [1]:
# Read in the data to a DataFrame from a url - I'll give this one to you since it is new.

import pandas as pd

df_ufos = pd.read_csv('http://bit.ly/uforeports')

In [3]:
# run a quick EDA on the DataFrame showing the column names, data type for each column, the number of entries,
# and the number of non-null values for each entry

df_ufos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
City               18216 non-null object
Colors Reported    2882 non-null object
Shape Reported     15597 non-null object
State              18241 non-null object
Time               18241 non-null object
dtypes: object(5)
memory usage: 712.7+ KB

In [84]:
# Find the shape of the DataFrame

df_ufos.shape

(18241, 5)

In [85]:
# Find the unique values in the "state" column

df_ufos['State'].unique()

array(['NY', 'NJ', 'CO', 'KS', 'ND', 'CA', 'MI', 'AK', 'OR', 'AL', 'SC',
       'IA', 'GA', 'TN', 'NE', 'LA', 'KY', 'WV', 'NM', 'UT', 'RI', 'FL',
       'VA', 'NC', 'TX', 'WA', 'ME', 'IL', 'AZ', 'OH', 'PA', 'MN', 'WI',
       'MD', 'SD', 'NV', 'ID', 'MO', 'OK', 'IN', 'CT', 'MS', 'AR', 'WY',
       'MA', 'MT', 'DE', 'NH', 'VT', 'HI', 'Ca', 'Fl'], dtype=object)

In [86]:
# display all of the UFO incidents that occurred in Washington and save it as a df of its own

wa_ufos_df = df_ufos[df_ufos['State'] == 'WA']

display(wa_ufos_df)

             City Colors Reported Shape Reported State              Time
45          Index             NaN       FIREBALL    WA   6/30/1946 21:00
62         Tacoma             NaN          OTHER    WA    6/30/1947 0:00
64       Cashmere             NaN      FORMATION    WA    7/1/1947 20:00
68        Seattle             NaN           OVAL    WA    7/4/1947 17:30
99        Seattle             NaN           DISK    WA   4/10/1949 15:00
...           ...             ...            ...   ...               ...
18150     Spokane             NaN          LIGHT    WA  12/18/2000 17:00
18168  Bellingham             NaN         SPHERE    WA  12/21/2000 19:10
18176     Seattle             NaN            NaN    WA  12/23/2000 20:00
18180  Moses Lake             NaN       TRIANGLE    WA   12/24/2000 8:32
18204   Bremerton             NaN          OTHER    WA   12/28/2000 3:00

[1322 rows x 5 columns]

In [87]:
# Find the number of incidents that occurred in each city in Washington from the Washington DF you just made

display(wa_ufos_df['City'].value_counts())

# Display all of the unique cities in Washington where an incident occurred

display(wa_ufos_df['City'].unique())

# Select a single city and display the incidents which occurred in that city

display(wa_ufos_df[wa_ufos_df['City']=="Gig Harbor"])

Seattle                      187
Tacoma                        52
Spokane                       49
Vancouver                     34
Auburn                        29
                            ...
Chinook                        1
Mt. Rainier National Park      1
Rocky Point                    1
Startup                        1
Hwy. 18                        1
Name: City, Length: 347, dtype: int64

array(['Index', 'Tacoma', 'Cashmere', 'Seattle', 'Steilacoom',
       'Fort Lewis', 'Otis Orchards', 'Spokane Valley', 'Allyn', 'Auburn',
       'North Bend', 'Richland', 'Wenatchee', 'Kelso', 'Puyallup',
       'Carnation', 'Longview', 'Silverdale', 'Bellevue', 'Castle Rock',
       'Marysville', 'Yakima', 'Silverfdale', 'Cottonwood', 'Sumner',
       'Snohomish', 'Joyce', 'San Juan Island', 'Normandy Park',
       'Washougal', 'Camas', 'North Yakima', 'Hoquiam', 'Burlington',
       'Colville', 'Kennewick', 'Fairmont', 'Leavenworth',
       'Bonney Lake area', 'Kent', 'Bellingham', 'Toutle River',
       'Lake Cushman', 'Renton', 'Seatac', 'Pasco', 'Anacortes',
       'Ft. Lewis', 'Burien', 'Blaine', 'Walla Walla', 'Lake Dorothy',
       'Oroville', 'Issaquah', 'Molson', 'Vancouver', 'Spokane',
       'Woodland', 'Bremerton', 'Ellensburg', 'Maple Valley', 'Monroe',
       'Plain', 'Sultan', 'Oak Harbor', 'Kirkland', 'Olympia', 'Rosalia',
       'Lynden', 'Redondo', 'Spanaway', 'Fall City', 'Cowiche', 'Pomeroy',
       'Sedro-Woolley', 'Shoreline', 'Lopez Island', 'Grand Coulee',
       'Federal Way', 'Everett', 'Bonney Lake', 'Warden', 'Vashon Island',
       'Mountlake Terrace', 'Hoodsport', 'Stevens Pass', 'Ridgefield',
       'Toppenish', 'Stanwood', 'Covington', 'Sunnyside',
       'Mt. Rainier National Park', 'Deer Park', 'Woodinville',
       'Whidbey Island', 'Maxwelton Beach', 'N. Cascades Nat. Park',
       'Gig Harbor', 'Rochester', 'Ethell', 'Yacolt',
       'Gifford Pinchot National Forrest', 'Hansville', 'Aberdeen',
       'Olalla', 'Sequim', 'Baker Lake', 'Mount Rainier National Park',
       'Banks Lake', 'Snoqualmine', 'Colfax', 'Methow', 'Birch Bay',
       'Copalis Beach', 'Mercer Island', 'Black Diamond', 'Arlington',
       'Shelton', 'Redmond', 'Kitsap County', 'Connell', 'Carlsberg',
       'Port Townsend', 'Centralia', 'Orting', 'Snohomish Co.', 'Pateros',
       'Chinook', 'Okanogan', 'Yakima Indian Reservation',
       'Yakama Indian Reservation', 'Spirit Lake Highway', 'Coupeville',
       'Tonasket', 'Cougar', 'Meadowdale', 'Milton', 'NAS Whidby Island',
       'Matlock', 'Lynnwood', 'Gold Bar', 'Maltby', 'Randle',
       'N. Seattle', 'Lacey', 'Moses Lake', 'Tekoa', 'Carbonado',
       'Orcas Island', 'Bingen', 'Neah Bay', 'La Crosse', 'Roy',
       'Warm Beach', 'Morton', 'Poulsbo', 'Concrete', 'Chimacum',
       'Port Hadlock', 'Nine Mile Falls', 'Raymond', 'Quilcene',
       'Vantage', 'North Cove', 'Lake Tahuyeh', 'Colville Reservation',
       'Mill Creek', 'Mt. Vernon', 'Mukilteo', 'Electric City',
       'Eastgate', 'Burley', 'Whatcom County', 'Hwy. 18', 'Snoqualmie',
       'Elma', 'Friday Harbor', 'MM 99 mile Exit', 'Kalama', 'Lakewood',
       'Ferndale', 'Benton City', 'Tumwater', 'Port Angeles',
       'Longbranch', 'Ocean Shores', 'Fircrest', 'East Tacoma',
       'South Prarie', 'Edmonds', 'Pacific', 'Port Orchard',
       'West Seattle', 'Hazel Dell', 'Crescent Lake', 'Bothell',
       'Lancaster', 'Snoqualmie Pass', 'Arcadia Shores', 'Fife',
       'Hoh River', 'South Park', 'Granite', 'Holly', 'Laporte',
       'Des Moines', 'Dayton', 'Rocky Point', nan, 'Startup', 'Manson',
       'Sedro Woolley', 'Chelan', 'Rock Island', 'Wishkah River',
       'Nisqually Delta', 'Lake Stevens', 'Scottsdale', 'Monitor',
       'Walla Walla Airport', 'Marblemount', 'Langley', 'Granite Falls',
       'Troutdale', 'Newcastle', 'Tri-Cities', 'Guemes Island',
       'N. Everett', 'Cle Elum', 'Rockford', 'Lakebay', 'Cascade Mtns.',
       'Hoh Rain Forest', 'University Place', 'Brinnon',
       'Metalline Falls', 'George', 'Creston', 'Forks', 'Duvall',
       'Lake City', 'Outlook', 'Long Beach', 'La Conner', 'Winthrop',
       'Pullman', 'Trout Lake', 'North Lynnwood', 'Sammamish', 'Rosburg',
       'Enumclaw', 'Buena Vista', 'Kenmore', 'Freeland', 'East Wenatchee',
       'I-90', 'Graham', 'Grayland', 'Bangor Submarine Base', 'Republic',
       'West Richland', 'Loomis', 'South Prairie', 'Tukwila',
       'Rimrock Lake', 'Blewett Pass-top of mountain pass',
       'San Juan Islands', 'Illwaco', 'Frances',
       'Mt. Rainier north side, near Cateract Valley', 'Manashtash Ridge',
       'Mt. Baker', 'Bayview', 'Roslyn', 'Wauconda', 'Nisqually',
       'Suquamish', 'Columbia River { mile marker 230}', 'Silverlake',
       'Mattawa', 'Cheney', 'Battle Ground', 'Bainbridge Island',
       'Camano Island', 'Puget Sound', 'Valley', 'Addy', 'Suncrest',
       'Indianola', 'Selah', 'Buckley', 'Greenwater', 'Lyle',
       'Olympic Mountains', 'Westport', 'East Hoquiam', 'Seabeck',
       'Grandview', 'Hatton', 'Edgewood', 'Winlock', 'Ballard',
       'Maury Island', 'Sun Cove', 'Olympic National Park', 'Brier',
       'Mica Mountain', 'Wiley', 'Desert Aire', 'Mt Rainier',
       'Goldendale', 'Mount Vernon', 'Montesano', 'Orondo', 'Mead',
       'Conconully', 'Ritzville', 'Everson', 'Kingston', 'Clinton',
       'Sprague', 'Yelm', 'Ephrata', 'Saddle Mountains', 'Purdy',
       'Toledo', 'Newman Lake', 'Northbend', 'Harrington', 'Northport',
       'Sea Tac Airport', 'Malo',
       'Des Moines--4 blocks east of the Marina, Wash', 'Tokeland',
       'Hwy 12', 'Cottage Grove', 'Stanwood - I-5 corridor', 'Deer Lake',
       'Crescent Bar', 'Key Peninsula', 'Maple Falls', 'Liberty', 'Bow',
       'Vaughn', 'Elmira', 'Mt Vernon', 'Darrington', 'Fargher Lake'],
      dtype=object)

             City Colors Reported Shape Reported State              Time
4216   Gig Harbor             NaN         CIRCLE    WA  10/15/1979 21:00
6473   Gig Harbor             NaN       FIREBALL    WA  11/15/1990 18:00
7046   Gig Harbor             NaN           DISK    WA    6/1/1993 16:00
7654   Gig Harbor             RED            NaN    WA  12/31/1994 18:32
8509   Gig Harbor             NaN            NaN    WA   8/13/1995 22:00
10885  Gig Harbor             NaN          LIGHT    WA   10/20/1997 8:45
10950  Gig Harbor             NaN      FORMATION    WA  11/14/1997 21:00
13579  Gig Harbor             NaN         CIRCLE    WA     6/1/1999 1:00
16251  Gig Harbor             NaN           DISK    WA   4/15/2000 13:45
16374  Gig Harbor             NaN         SPHERE    WA    5/4/2000 10:30

In [88]:
# Establish a DF for all of the incidents that occurred in Gig Harbor, then display it

gh_ufos_df = wa_ufos_df[wa_ufos_df.City == 'Gig Harbor']

gh_ufos_df

             City Colors Reported Shape Reported State              Time
4216   Gig Harbor             NaN         CIRCLE    WA  10/15/1979 21:00
6473   Gig Harbor             NaN       FIREBALL    WA  11/15/1990 18:00
7046   Gig Harbor             NaN           DISK    WA    6/1/1993 16:00
7654   Gig Harbor             RED            NaN    WA  12/31/1994 18:32
8509   Gig Harbor             NaN            NaN    WA   8/13/1995 22:00
10885  Gig Harbor             NaN          LIGHT    WA   10/20/1997 8:45
10950  Gig Harbor             NaN      FORMATION    WA  11/14/1997 21:00
13579  Gig Harbor             NaN         CIRCLE    WA     6/1/1999 1:00
16251  Gig Harbor             NaN           DISK    WA   4/15/2000 13:45
16374  Gig Harbor             NaN         SPHERE    WA    5/4/2000 10:30

## Bonus Exercise 1

There are two mistypes in the 'State' column of the original dataset. Find them and correct them.

In [89]:
# Find the errors

df_ufos['State'].unique()

array(['NY', 'NJ', 'CO', 'KS', 'ND', 'CA', 'MI', 'AK', 'OR', 'AL', 'SC',
       'IA', 'GA', 'TN', 'NE', 'LA', 'KY', 'WV', 'NM', 'UT', 'RI', 'FL',
       'VA', 'NC', 'TX', 'WA', 'ME', 'IL', 'AZ', 'OH', 'PA', 'MN', 'WI',
       'MD', 'SD', 'NV', 'ID', 'MO', 'OK', 'IN', 'CT', 'MS', 'AR', 'WY',
       'MA', 'MT', 'DE', 'NH', 'VT', 'HI', 'Ca', 'Fl'], dtype=object)

In [90]:
# Find the rows that contain each of the errors and display them

display(df_ufos[df_ufos['State'] == 'Ca'])
display(df_ufos[df_ufos['State'] == 'Fl'])

         City Colors Reported Shape Reported State             Time
6750  Landers             NaN       FIREBALL    Ca  4/15/1992 22:00

                   City Colors Reported Shape Reported State             Time
9263  Fort Walton Beach             NaN            NaN    Fl   4/28/1996 0:10
9316              Miami          ORANGE            NaN    Fl   5/17/1996 1:30
9328             Venice             NaN            NaN    Fl  5/22/1996 20:30
9335         Fort Myers             NaN            NaN    Fl   5/26/1996 1:55

In [91]:
# Correct the errors for the first group

df_ufos.loc[6750, 'State'] = 'CA'

In [92]:
# Correct the errors for the second group

df_ufos.loc[[9263, 9316, 9328, 9335], 'State'] = 'FL'

In [93]:
# Check your work to see that the corrections have been made

df_ufos['State'].unique()

array(['NY', 'NJ', 'CO', 'KS', 'ND', 'CA', 'MI', 'AK', 'OR', 'AL', 'SC',
       'IA', 'GA', 'TN', 'NE', 'LA', 'KY', 'WV', 'NM', 'UT', 'RI', 'FL',
       'VA', 'NC', 'TX', 'WA', 'ME', 'IL', 'AZ', 'OH', 'PA', 'MN', 'WI',
       'MD', 'SD', 'NV', 'ID', 'MO', 'OK', 'IN', 'CT', 'MS', 'AR', 'WY',
       'MA', 'MT', 'DE', 'NH', 'VT', 'HI'], dtype=object)

## Bonus Exercise 2

Clean up the column names for the dataset and save it to the folder called 'data' in the lesson directory.

In [10]:
display(df_ufos.head())

column_names = ['city', 'colors_reported', 'shape_reported', 'state', 'time']

df_ufos.columns = column_names

display(df_ufos.head())

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

                   city colors_reported shape_reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [12]:
df_ufos.to_csv('data/ufo_df_cleaned.csv')